name: "enhancer_ensemble"
platform: "ensemble"
max_batch_size: 0

input [
  {
    name: "INPUT_AUDIO",
    data_type: TYPE_FP32,
    dims: [ -1 ]
  },
  {
    name: "SAMPLE_RATE",
    data_type: TYPE_INT64,
    dims: [ 1 ]
  },
  {
    name: "CHUNK_DURATION_S",
    data_type: TYPE_FP32,
    dims: [ 1 ]
  },
  {
    name: "CHUNK_OVERLAP_S",
    data_type: TYPE_FP32,
    dims: [ 1 ]
  }
]

output [
  {
    name: "OUTPUT_AUDIO",
    data_type: TYPE_FP32,
    dims: [ -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocessing",
      model_version: -1,
      input_map {
        key: "INPUT_AUDIO",
        value: "INPUT_AUDIO"
      },
      input_map {
        key: "SAMPLE_RATE",
        value: "SAMPLE_RATE"
      },
      input_map {
        key: "CHUNK_DURATION_S",
        value: "CHUNK_DURATION_S"
      },
      input_map {
        key: "CHUNK_OVERLAP_S",
        value: "CHUNK_OVERLAP_S"
      },
      output_map {
        key: "BATCHED_SAMPLES",
        value: "BATCHED_SAMPLES"
      },
      output_map {
        key: "AUDIO_LENGTH",
        value: "AUDIO_LENGTH"
      }
    },
    {
      model_name: "enhancer",
      model_version: -1,
      input_map {
        key: "input",
        value: "BATCHED_SAMPLES"
      },
      output_map {
        key: "output",
        value: "AUDIO_SAMPLES"
      }
    },
    {
      model_name: "postprocessing",
      model_version: -1,
      input_map {
        key: "AUDIO_CHUNKS",
        value: "AUDIO_SAMPLES"
      },
      input_map {
        key: "AUDIO_LENGTH",
        value: "AUDIO_LENGTH"
      },
      input_map {
        key: "CHUNK_DURATION_S",
        value: "CHUNK_DURATION_S"
      },
      input_map {
        key: "CHUNK_OVERLAP_S",
        value: "CHUNK_OVERLAP_S"
      },
      output_map {
        key: "OUTPUT_AUDIO",
        value: "OUTPUT_AUDIO"
      }
    }
  ]
}
